//
// KeyWords.cpp
//
#include "stdafx.h"
#include "Erags.h"

#include "KeyWords.h"

#ifdef _DEBUG
#define new DEBUG_NEW
#undef THIS_FILE
static char THIS_FILE[] = __FILE__;
#endif

CKeywords theKeywords;

Keyword Keywords[] = {

  { IDKW_44                 , _T("ЧЧ")              }, // Дата реєстрації, число
  { IDKW_44N                , _T("ЧЧН")             }, // Дата народження: дд
  { IDKW_4MPROPYSOM         , _T("ЧМПРОПИСОМ")      }, // Дата народження: число та місяць прописом
  { IDKW_4N4                , _T("ЧНЧ")             }, // Дата народження чоловіка: число
  { IDKW_4NZ                , _T("ЧНЖ")             }, // Дата народження жінки: число

  // A
  { IDKW_ADRESA             , _T("АДРЕСА")          }, // Адреса
  { IDKW_ADRM               , _T("АДРМ")            }, // Адреса матері новонародженого
  { IDKW_ADRP               , _T("АДРП")            }, // Адреса померлого
  { IDKW_ADRZ               , _T("АДРЗ")            }, // Адреса заявника
  { IDKW_ALIVE              , _T("ЖЧМ")             }, // "живонароджена" або "мертвонароджена"
  { IDKW_ARKUSH             , _T("АРКУШ")           }, // № поточного аркуша
  { IDKW_ARKUSHIV           , _T("АРКУШІВ")         }, // Кількість аркушів
  { IDKW_AZPRO              , _T("АЗПРО")           }, // АЗ "про", наприклад про "народження"
  { IDKW_AZPRODATA          , _T("АЗПРОДАТА")       }, // Дата АЗ "про", наприклад дата АЗ про "народження"
  { IDKW_AZPRONAZ           , _T("АЗПРОНАЗ")        }, // № АЗ, де належить внести зміни

  // B
  { IDKW_BANK               , _T("БАНК")            }, // Банк, де сплачено держмито
  { IDKW_BANK4              , _T("БАНКЧ")           }, // Банк чоловіка
  { IDKW_BANKZ              , _T("БАНКЖ")           }, // Банк жінки
  { IDKW_BUD                , _T("БУД")             }, // Місце проживання: будинок
  { IDKW_BUD4               , _T("БУДЧ")            }, // Місце проживання чоловіка: будинок
  { IDKW_BUDB               , _T("БУДБ")            }, // Місце проживання батька: будинок
  { IDKW_BUDM               , _T("БУДМ")            }, // Місце проживання матері: будинок
  { IDKW_BUDZ               , _T("БУДЖ")            }, // Місце проживання жінки: будинок

  // D
  { IDKW_D44                , _T("ДЧЧ")             }, // Період (до) ЧЧ (ДД)
  { IDKW_DAZN               , _T("ДАЗН")            }, // Дата АЗ про народження
  { IDKW_DATADOV            , _T("ДАТАДОВ")         }, // Дата довідки
  { IDKW_DATAN              , _T("ДАТАН")           }, // Дата народження
  { IDKW_DATAN4             , _T("ДАТАНЧ")          }, // Дата народження чоловіка

  // { IDKW_DATAN4Z            , _T("ДАТАНЧЖ")         }, // Дата народження чоловіка або жінки
  { IDKW_DATANB             , _T("ДАТАНБ")          }, // Дата народження батька
  { IDKW_DATANM             , _T("ДАТАНМ")          }, // Дата народження матері
  { IDKW_DATANZ             , _T("ДАТАНЖ")          }, // Дата народження жінки
  { IDKW_DATAP              , _T("ДАТАП")           }, // Дата паспорта (документа)
  { IDKW_DATAS              , _T("ДАТАС")           }, // Дата смерті
  { IDKW_DATASH             , _T("ДАТАШ")           }, // Дата реєстрації шлюбу
  { IDKW_DDMMMRRRR          , _T("ДДМММРРРР")       }, // Дата реєстрації ДД МММ РРРР
  { IDKW_DDMMRRRR           , _T("ДДММРРРР")        }, // Дата реєстрації: дд.мм.рррр
  { IDKW_DDOZV              , _T("ДДОЗВ")           }, // Дата дозволу (29)
  { IDKW_DERZMYTO           , _T("ДЕРЖМИТО")        }, // Держмито
  { IDKW_DK                 , _T("ДК")              }, // Дата квітанції
  { IDKW_DK4                , _T("ДКЧ")             }, // Дата квітанції чоловіка
  { IDKW_DKZ                , _T("ДКЖ")             }, // Дата квітанції жінки
  { IDKW_DITEY              , _T("ДІТЕЙ")           }, // Скількі народилося дітей
  { IDKW_DMMM               , _T("ДМММ")            }, // Період (до) МММ
  { IDKW_DN44               , _T("ДНЧЧ")            }, // Дата народження: дд (число)
  { IDKW_DN                 , _T("ДН")              }, // Держава народження
  { IDKW_DNMM               , _T("ДНММ")            }, // Дата народження: мм
  { IDKW_DNMMM              , _T("ДНМММ")           }, // Дата народження: ммм
  { IDKW_DNRR               , _T("ДНРР")            }, // Дата народження: рр
  { IDKW_DNRRRR             , _T("ДНРРРР")          }, // Дата народження: рррр
  { IDKW_DNDDMMRRRR         , _T("ДНДДММРРРР")      }, // Дата народження: дд.мм.рррр
  { IDKW_DNDDMMMRRRR        , _T("ДНДДМММРРРР")     }, // Дата народження: дд місяця рррр
  { IDKW_DNIV               , _T("ДНІВ")            }, // днів
  { IDKW_DO                 , _T("ДО")              }, // До (орган, куди пред'являється довідка) кінець або періоду, за який здійснювався пошук
  { IDKW_DO_VIDDILU         , _T("ДО ВІДДІЛУ")      }, // Назва відділу РАГС в орудному відмінку
  { IDKW_DOCUMENT           , _T("ДОКУМЕНТ")        }, // Документ, що підтверджує факт народження дитини
  { IDKW_DOCUMENTIV         , _T("ДОКУМЕНТІВ")      }, // Кількість громадян
  { IDKW_DP                 , _T("ДП")              }, // Держава проживання
  { IDKW_DPR                , _T("ДПР")             }, // Дата прийняття рішення (свідоцтво про усиновлення)
  { IDKW_DRRRR              , _T("ДРРРР")           }, // Період (до) РРРР
  { IDKW_DRRSH              , _T("ДРРШ")            }, // Дата реєстрації шлюбу
  { IDKW_DRSHLUBU           , _T("ДРШЛЮБУ")         }, // Дата реєстрації розірвання шлюбу
  { IDKW_DS                 , _T("ДС")              }, // Держава смерті
  { IDKW_DSDDMMRRRR         , _T("ДСДДММРРРР")      }, // Дата смерті: ДД.ММ.РРРР
  { IDKW_DSDDMMMRRRR        , _T("ДСДДМММРРРР")     }, // Дата смерті: ДД МММ РРРР
  { IDKW_DSM                , _T("ДСМ")             }, // Дата смерті: дд - день
  { IDKW_DV                 , _T("ДВ")              }, // Дата видачі
  { IDKW_DV44               , _T("ДВЧЧ")            }, // Дата видачі свідоцтва: ЧЧ - число
  { IDKW_DVMMM              , _T("ДВМММ")           }, // Дата видачі свідоцтва: МММ - місяця
  { IDKW_DVRR               , _T("ДВРР")            }, // Дата видачі свідоцтва: РР - рік
  { IDKW_DVRRRR             , _T("ДВРРРР")          }, // Дата видачі свідоцтва: РРРР - століття+рік
  { IDKW_DVYSN              , _T("ДВИСН")           }, // Дата висновку (29)

  // G
  { IDKW_GROMADYAN          , _T("ГРОМАДЯН")        }, // Кількість громадян
  { IDKW_GROMADYANYNA       , _T("ГРОМАДЯНИНА")     }, // "громадянина" або "громадянки" (залижить від статі)
  { IDKW_GROMADYANSTVO      , _T("ГРОМАДЯНСТВО")    }, // Громадянство
  { IDKW_GROMADYANSTVO4     , _T("ГРОМАДЯНСТВОЧ")   }, // Громадянство чоловіка
  { IDKW_GROMADYANSTVOB     , _T("ГРОМАДЯНСТВОБ")   }, // Громадянство батька
  { IDKW_GROMADYANSTVOM     , _T("ГРОМАДЯНСТВОМ")   }, // Громадянство матері
  { IDKW_GROMADYANSTVOZ     , _T("ГРОМАДЯНСТВОЖ")   }, // Громадянство жінки
  // { IDKW_GROMADYANSTVO4Z    , _T("ГРОМАДЯНСТВОЧЖ")  }, // Громадянство чоловіка або жінки
  
  // E
  { IDKW_EDRPOU             , _T("ЄДРПОУ")          }, // ЄДРПОУ відділу

  // I
  { IDKW_IM4                , _T("ІМЧ")             }, // Ім'я чоловіка
  { IDKW_IM4OV              , _T("ІМЧОВ")           }, // Ім'я чоловіка в орудному відмінку
  { IDKW_IMB                , _T("ІМБ")             }, // Ім'я батька
  { IDKW_IMBV               , _T("ІМБВ")            }, // Ім'я безвісно відсутнього
  { IDKW_IMIN               , _T("ІМІН")            }, // Ім'я ініциатора
  { IDKW_IMINOV             , _T("ІМІНОВ")          }, // Ім'я ініциатора в орудному відмінку
  { IDKW_IMKVS              , _T("ІМКВС")           }, // Ім'я (кому видано свідоцтво)
  { IDKW_IMN                , _T("ІМН")             }, // Ім'я новонародженного
  { IDKW_IMM                , _T("ІММ")             }, // Ім'я матері (для народжень)
  { IDKW_IMP                , _T("ІМП")             }, // Ім'я померлого
  { IDKW_IMRV               , _T("ІМРВ")            }, // Ім'я у родовому відмінку
  { IDKW_IMZ                , _T("ІМЖ")             }, // Ім'я жінки
  { IDKW_IMZOV              , _T("ІМЖОВ")           }, // Ім'я жінки в орудному відмінку
  { IDKW_IN                 , _T("ІН")              }, // Ідентефікаційний номер (код)

  // K
  { IDKW_KDITEY             , _T("КДІТЕЙ")          }, // Кількість дітей
  { IDKW_KERIVNYK           , _T("КЕРІВНИК")        }, // Керівник відділу
  { IDKW_KV                 , _T("КВ")              }, // Місце проживання: квартира
  { IDKW_KV4                , _T("КВЧ")             }, // Місце проживання чоловіка: квартира
  { IDKW_KVB                , _T("КВБ")             }, // Місце проживання батька: квартира
  { IDKW_KVM                , _T("КВМ")             }, // Місце проживання матері: квартира
  { IDKW_KVP                , _T("КВП")             }, // Ким видано паспорт (документ)
  { IDKW_KVZ                , _T("КВЖ")             }, // Місце проживання жінки: квартира

  // L
  { IDK_LIVE_OR_NO          , _T("ЖИВОНАРОДЖЕНА ЧИ МЕРТВОНАРОДЖЕНА")  }, // !Живонароджена чи мертвонароджена!

  // M
  { IDKW_MISCENAR4          , _T("МІСЦЕНАРЧ")       }, // Місце народження чоловіка
  { IDKW_MISCENARZ          , _T("МІСЦЕНАРЖ")       }, // Місце народження жінки
  { IDKW_MISYAC             , _T("МІСЯЦЬ")          }, // місяць
  { IDKW_MISYACIV           , _T("МІСЯЦІВ")         }, // Місяців
  { IDKW_MMM                , _T("МММ")             }, // Дата реєстрації: місяця
  { IDKW_MMMN               , _T("МММН")            }, // Дата народження: місяць
  { IDKW_MN4                , _T("МНЧ")             }, // Дата народження чоловіка: місяць
  { IDKW_MN4D               , _T("МНЧД")            }, // Місце народження чоловіка: Держава
  { IDKW_MN4M               , _T("МНЧМ")            }, // Місце народження чоловіка: місто (село, селище) - назва НП
  { IDKW_MN4MSS             , _T("МНЧМСС")          }, // Місце народження чоловіка: місто (село, селище) - тип НП
  { IDKW_MN4O               , _T("МНЧО")            }, // Місце народження чоловіка: Область
  { IDKW_MN4OBL             , _T("МНЧОБЛ")          }, // Місце народження чоловіка: Область + область
  { IDKW_MN4OBLAST          , _T("МНЧОБЛАСТЬ")      }, // Місце народження чоловіка: Область + область
  { IDKW_MN4OBL_            , _T("МНЧОБЛ.")         }, // Місце народження чоловіка: Область + обл.
  { IDKW_MN4R               , _T("МНЧР")            }, // Місце народження чоловіка: Район
  { IDKW_MN4R_N             , _T("МНЧР-Н")          }, // Місце народження чоловіка: Район + р-н
  { IDKW_MN4RAYON           , _T("МНЧРАЙОН")        }, // Місце народження чоловіка: Район + район
  { IDKW_MNZ                , _T("МНЖ")             }, // Дата народження жінки: місяць
  { IDKW_MNZD               , _T("МНЖД")            }, // Місце народження жінки: держава 
  { IDKW_MNZM               , _T("МНЖМ")            }, // Місце народження жінки: місто (село, селище) - назва НП
  { IDKW_MNZMSS             , _T("МНЖМСС")          }, // Місце народження жінки: місто (село, селище) - тип НП
  { IDKW_MNZO               , _T("МНЖО")            }, // Місце народження жінки: Область
  { IDKW_MNZOBL             , _T("МНЖОБЛ")          }, // Місце народження жінки: Область + область
  { IDKW_MNZOBLAST          , _T("МНЖОБЛАСТЬ")      }, // Місце народження жінки: Область + область
  { IDKW_MNZOBL_            , _T("МНЖОБЛ.")         }, // Місце народження жінки: Область + обл.
  { IDKW_MNZR               , _T("МНЖР")            }, // Місце народження жінки: Район
  { IDKW_MNZR_N             , _T("МНЖР-Н")          }, // Місце народження жінки: Район + р-н
  { IDKW_MNZRAYON           , _T("МНЖРАЙОН")        }, // Місце народження жінки: Район + район

  { IDKW_MP                 , _T("МП")              }, // Місце проживання: Місто
  { IDKW_MP4D               , _T("МПЧД")            }, // Місце проживання чоловіка: Держава
  { IDKW_MP4M               , _T("МПЧМ")            }, // Місце проживання чоловіка: місто (село, селище) - назва НП
  { IDKW_MP4MSS             , _T("МПЧМСС")          }, // Місце проживання чоловіка: місто (село, селище) - тип НП
  { IDKW_MP4O               , _T("МПЧО")            }, // Місце проживання чоловіка: Область
  { IDKW_MP4OBL             , _T("МПЧОБЛ")          }, // Місце проживання чоловіка: Область + область
  { IDKW_MP4OBLAST          , _T("МПЧОБЛАСТЬ")      }, // Місце проживання чоловіка: Область + область
  { IDKW_MP4OBL_            , _T("МПЧОБЛ.")         }, // Місце проживання чоловіка: Область + обл.
  { IDKW_MP4R               , _T("МПЧР")            }, // Місце проживання чоловіка: Район
  { IDKW_MP4R_N             , _T("МПЧР-Н")          }, // Місце проживання чоловіка: Район + р-н
  { IDKW_MP4RAYON           , _T("МПЧРАЙОН")        }, // Місце проживання чоловіка: Район + район
  // { IDKW_MP4ZM              , _T("МПЧЖМ")           }, // Місце проживання чоловіка або жінки: місто (село, селище) - назва НП
  // { IDKW_MP4ZMSS            , _T("МПЧЖМСС")         }, // Місце проживання чоловіка або жінки: місто (село, селище) - тип НП
  // { IDKW_MP4ZD              , _T("МПЧЖД")           }, // Місце проживання чоловіка або жінки: Держава
  // { IDKW_MP4ZO              , _T("МПЧЖО")           }, // Місце проживання чоловіка або жінки: Область
  // { IDKW_MP4ZOBL            , _T("МПЧЖОБЛ")         }, // Місце проживання чоловіка або жінки: Область + область
  // { IDKW_MP4ZOBLAST         , _T("МПЧЖОБЛАСТЬ")     }, // Місце проживання чоловіка або жінки: Область + область
  // { IDKW_MP4ZOBL_           , _T("МПЧЖОБЛ.")        }, // Місце проживання чоловіка або жінки: Область + обл.

  // { IDKW_MP4ZR              , _T("МПЧЖР")           }, // Місце проживання чоловіка або жінки: Район
  // { IDKW_MP4ZR_N            , _T("МПЧЖР-Н")         }, // Місце проживання чоловіка або жінки: Район + р-н
  // { IDKW_MP4ZRAYON          , _T("МПЧЖРАЙОН")       }, // Місце проживання чоловіка або жінки: Район + район

  { IDKW_MPBD               , _T("МПБД")            }, // Місце проживання батька: Держава
  { IDKW_MPBO               , _T("МПБО")            }, // Місце проживання батька: Область
  { IDKW_MPBOBL             , _T("МПБОБЛ")          }, // Місце проживання батька: Область + область
  { IDKW_MPBOBL_            , _T("МПБОБЛ.")         }, // Місце проживання батька: Область + обл.
  { IDKW_MPBR               , _T("МПБР")            }, // Місце проживання батька: Район
  { IDKW_MPBR_N             , _T("МПБР-Н")          }, // Місце проживання батька: Район + р-н
  { IDKW_MPBRAYON           , _T("МПБРАЙОН")        }, // Місце проживання батька: Район + район
  { IDKW_MSSB               , _T("МССБ")            }, // Місце проживання батька: місто (село селище) - тип НП
  { IDKW_MPBM               , _T("МПБМ")            }, // Місце проживання батька: місто (село селище) - назва НП

  { IDKW_MPMD               , _T("МПМД")            }, // Місце проживання матері: Держава
  { IDKW_MPMO               , _T("МПМО")            }, // Місце проживання матері: Область
  { IDKW_MPMOBL             , _T("МПМОБЛ")          }, // Місце проживання матері: Область + область
  { IDKW_MPMOBL_            , _T("МПМОБЛ.")         }, // Місце проживання матері: Область + обл.
  { IDKW_MPMR               , _T("МПМР")            }, // Місце проживання матері: Район
  { IDKW_MPMR_N             , _T("МПМР-Н")          }, // Місце проживання матері: Район + р-н
  { IDKW_MPMRAYON           , _T("МПМРАЙОН")        }, // Місце проживання матері: Район + район
  { IDKW_MSSM               , _T("МССМ")            }, // Місце проживання матері: місто (село селище) - тип НП
  { IDKW_MPMM               , _T("МПММ")            }, // Місце проживання матері: місто (село селище) - назва НП

  { IDKW_MPZD               , _T("МПЖД")            }, // Місце проживання жінки: Держава
  { IDKW_MPZM               , _T("МПЖМ")            }, // Місце проживання жінки: місто (село, селище) - назва НП
  { IDKW_MPZMSS             , _T("МПЖМСС")          }, // Місце проживання жінки: місто (село, селище) - тип НП
  { IDKW_MPZO               , _T("МПЖО")            }, // Місце проживання жінки: Область
  { IDKW_MPZOBL             , _T("МПЖОБЛ")          }, // Місце проживання жінки: Область + область
  { IDKW_MPZOBLAST          , _T("МПЖОБЛАСТЬ")      }, // Місце проживання жінки: Область + область
  { IDKW_MPZOBL_            , _T("МПЖОБЛ.")         }, // Місце проживання жінки: Область + обл.
  { IDKW_MPZR               , _T("МПЖР")            }, // Місце проживання жінки: Район
  { IDKW_MPZR_N             , _T("МПЖР-Н")          }, // Місце проживання жінки: Район + р-н
  { IDKW_MPZRAYON           , _T("МПЖРАЙОН")        }, // Місце проживання жінки: Район + район


  { IDKW_MR_1               , _T("МР_1")            }, // Місце реєстрації: строка 1
  { IDKW_MR_2               , _T("МР_2")            }, // Місце реєстрації: строка 2
  { IDKW_MR_3               , _T("МР_3")            }, // Місце реєстрації: строка 3

  { IDKW_MS                 , _T("МС")              }, // Місце смерті: Місто (село, селище) - назва НП
  { IDKW_MSM                , _T("МСМ")             }, // Дата смерті: ммм - місяця
  { IDKW_MSS                , _T("МСС")             }, // Місце проживання: місто (село, селище) - тип НП
  { IDKW_MSS4               , _T("МССЧ")            }, // Місце проживання чоловіка: місто (село, селище) - тип НП
  // { IDKW_MSS4Z              , _T("МССЧЖ")           }, // Місце проживання чоловіка або жінки: місто (село, селище) - тип НП
  { IDKW_MSSN               , _T("МССН")            }, // Місце народження: місто (село, селище) - тип НП
  { IDKW_MSSP               , _T("МССП")            }, // Місце проживання: місто (село, селище) - тип НП
  { IDKW_MSSS               , _T("МССС")            }, // Місце смерті: Місто (село, селище) - тип НП
  { IDKW_MSSZ               , _T("МССЖ")            }, // Місце проживання жінки: місто (село, селище) - тип НП
  { IDKW_MW                 , _T("ЧЖ")              }, // Стать: "Ч" або "Ж"

  // N
  { IDKW_N                  , _T("№")               }, // Номер з/р
  { IDKW_N41                , _T("№41")             }, // Номер довідки (41)
  { IDKW_N42                , _T("№42")             }, // Номер довідки (42)
  { IDKW_N43                , _T("№43")             }, // Номер довідки (43)
  { IDKW_NARODYVSYA         , _T("НАРОДИВСЯ(ЛАСЬ)") }, // "народився" або "народилась" (залижить від статі)
  { IDKW_NARODYVSYA         , _T("НАРОДИВСЯ")       }, // "народився" або "народилась" (залижить від статі)
  { IDKW_NAZ                , _T("НАЗ")             }, // Номер актового запису
  { IDKW_NAZN               , _T("НАЗН")            }, // Номер АЗ про народження
  { IDKW_NAZSH              , _T("НАЗШ")            }, // Номер актового запису про шлюб
  { IDKW_NAZRSH             , _T("НАЗРШ")           }, // Номер актового запису про розірвання шлюбу
  { IDKW_ND                 , _T("НД")              }, // Номер довідки
  { IDKW_NDN8               , _T("НДН8")            }, // Номер довідки про народження (форма 8)
  { IDKW_NDN9               , _T("НДН9")            }, // Номер довідки про народження (форма 9)
  { IDKW_NDOC               , _T("НДОК")            }, // Назва документа
  { IDKW_NDOSZN_RV          , _T("НДОСЗН_РВ")       }, // Назва державного органу соцзахисту населення у родовому відмінку 
  { IDKW_NDOZV              , _T("НДОЗВ")           }, // Номер дозволу (29, 30)
  { IDKW_NDPO_RV            , _T("НДПО_РВ")         }, // Назва державного податкового органу у родовому відмінку
  { IDKW_NDS                , _T("НДС")             }, // Номер довідки про смерть
  { IDKW_NIM                , _T("НІМ")             }, // Нове ім'я (ПІСЛЯ зміни)
  { IDKW_NIM_               , _T("НІМ-")            }, // Нове ім'я (ПІСЛЯ зміни) або прочерк
  { IDKW_NK                 , _T("НК")              }, // Номер квітанції
  { IDKW_NK4                , _T("НКЧ")             }, // Номер квітанції чоловіка
  { IDKW_NKZ                , _T("НКЖ")             }, // Номер квітанції жінки
  { IDKW_NOVS_RV            , _T("НОВС_РВ")         }, // Назва органу внутрішніх справ у родовому відмінку
  { IDKW_NP                 , _T("НП")              }, // Номер паспорта (документа)
  { IDKW_NPB                , _T("НПБ")             }, // Нове по батькові (ПІСЛЯ зміни)
  { IDKW_NPB_               , _T("НПБ-")            }, // Нове по батькові (ПІСЛЯ зміни) або прочерк
  { IDKW_NPR                , _T("НПР")             }, // Прізвище ПІСЛЯ зміни
  { IDKW_NPR_               , _T("НПР-")            }, // Прізвище ПІСЛЯ зміни або прочерк
  { IDKW_NPRIMPB            , _T("НПРІМПБ")         }, // Нові прізвище, ім'я, по батькові (27)
  { IDKW_NS                 , _T("НС")              }, // Номер свідоцтва
  { IDKW_NS4                , _T("НСЧ")             }, // Номер свідоцтва чоловіка
  { IDKW_NSZ                , _T("НСЖ")             }, // Номер свідоцтва жінки
  { IDKW_NV                 , _T("НВ")              }, // Номер (вихідний)
  { IDKW_NVK_RV             , _T("НВК_РВ")          }, // Назва військового комісаріату у родовому відмінку
  { IDKW_NVRACS             , _T("НВРАЦС")          }, // Назва відділу РАГС
  { IDKW_NVRAGS             , _T("НВРАГС")          }, // Назва відділу РАГС
  { IDKW_NVRACS_DV          , _T("НВРАЦС_ДВ")       }, // Назва відділу РАГС в давальному відмінку
  { IDKW_NVRAGS_OV          , _T("НВРАГС_ОВ")       }, // Назва відділу РАГС в орудному відмінку
  { IDKW_NVRACS_OV          , _T("НВРАЦС_ОВ")       }, // Назва відділу РАГС в орудному відмінку
  { IDKW_NVRAGSOV           , _T("НВРАГСОВ")        }, // Назва відділу РАГС в орудному відмінку
  { IDKW_NVRACS_RV          , _T("НВРАЦС_РВ")       }, // Назва відділу РАГС в родовому відмінку
  { IDKW_NVRAGS_RV          , _T("НВРАГС_РВ")       }, // Назва відділу РАГС в родовому відмінку
  { IDKW_NVRACSRV           , _T("НВРАГЦРВ")        }, // Назва відділу РАГС в родовому відмінку
  { IDKW_NVRAGSRV           , _T("НВРАГСРВ")        }, // Назва відділу РАГС в родовому відмінку
  { IDKW_NVRACS_MV          , _T("НВРАЦС_МВ")       }, // Назва відділу РАГС в місцевому відмінку
  { IDKW_NVRAGS_MV          , _T("НВРАГС_МВ")       }, // Назва відділу РАГС в місцевому відмінку
  { IDKW_NVRACSMV           , _T("НВРАЦСМВ")        }, // Назва відділу РАГС в місцевому відмінку
  { IDKW_NVRAGSMV           , _T("НВРАГСМВ")        }, // Назва відділу РАГС в місцевому відмінку

  { IDKW_NRS                , _T("НРС")             }, // Номер рішення суду (свідоцтво про усиновлення)
  { IDKW_NVYSN              , _T("НВИСН")           }, // Номер висновку (29, 30)
  { IDKW_NSUDU              , _T("НСУДУ")           }, // Назва суда (свідоцтво про усиновлення)

  { IDKW_OR_1               , _T("ОР_1")            }, // Орган, що видав: строка 1
  { IDKW_OR_2               , _T("ОР_2")            }, // Орган, що видав: строка 2
  { IDKW_OR_3               , _T("ОР_3")            }, // Орган, що видав: строка 3
  

  // S
  { IDKW_S14                , _T("С1Ч")             }, //
  { IDKW_S1Z                , _T("С1Ж")             }, //
  { IDKW_S24                , _T("С2Ч")             }, //
  { IDKW_S2Z                , _T("С2Ж")             }, //
  { IDKW_SD                 , _T("СД")              }, // Системная дата
  { IDKW_SNV                , _T("СНВ")             }, // Свідоцтво не видано
  { IDKW_SP                 , _T("СП")              }, // Серія паспорта (документа)
  { IDKW_SPECIALIST         , _T("СПЕЦІАЛІСТ")      }, // Спеціаліст
  { IDKW_SPLA4ENO           , _T("СПЛАЧЕНО")        }, // Сплачено держмита

  { IDKW_STIM               , _T("СТІМ")            }, // Старе ім'я (ДО зміни)
  { IDKW_STIM_DV            , _T("СТІМ_ДВ")         }, // Старе ім'я (ДО зміни) в давальному відмінку
  { IDKW_STIM_RV            , _T("СТІМ_РВ")         }, // Старе ім'я (ДО зміни) в родовому відмінку
  { IDKW_STIMN              , _T("СТІМН")           }, // Старе ім'я новонародженного
  { IDKW_STPB               , _T("СТПБ")            }, // Старе по батькові (ДО зміни)
  { IDKW_STPB_DV            , _T("СТПБ_ДВ")         }, // Старе по батькові (ДО зміни) в давальному відмінку
  { IDKW_STPB_RV            , _T("СТПБ_РВ")         }, // Старе по батькові (ДО зміни) в родовому відмінку
  { IDKW_STPR               , _T("СТПР")            }, // Старе прізвище (ДО зміни)
  { IDKW_STPR_DV            , _T("СТПР_ДВ")         }, // Прізвище ДО зміни в давальному відмінку
  { IDKW_STPR_RV            , _T("СТПР_РВ")         }, // Прізвище ДО зміни в родовому відмінку
  { IDKW_STPRIMPB           , _T("СТПРІМПБ")        }, // Старі прізвище, ім'я, по батькові (27)
  { IDKW_STPRN              , _T("СТПРН")           }, // Старе прізвище новонародженого
  { IDKW_SS                 , _T("СС")              }, // Серія свідоцтва
  { IDKW_SSNS               , _T("ССНС")            }, // Серія свідоцтва № свідоцтва
  { IDKW_SS4                , _T("ССЧ")             }, // Серія свідоцтва чоловіка 
  { IDKW_SSZ                , _T("ССЖ")             }, // Серія свідоцтва жінки

 
  { IDKW_STAMP1             , _T("ШТАМП1")          }, // Штамп1
  { IDKW_STAMP2             , _T("ШТАМП2")          }, // Штамп2
  { IDKW_STAN4              , _T("СТАНЧ")           }, // Сімейний стан чоловіка 
  { IDKW_STAN4P             , _T("СТАНЧП")          }, // Сімейний стан нареченого (необхідне підкреслити)
  { IDKW_STANZ              , _T("СТАНЖ")           }, // Сімейний стан жінки
  { IDKW_STANZP             , _T("СТАНЖП")          }, // Сімейний стан нареченої (необхідне підкреслити)
  
  { IDKW_STPBN              , _T("СТПБН")           }, // Старе по батькові новонародженного
  { IDKW_STAT               , _T("СТАТЬ")           }, // Стать: "чоловіча" або "жіноча"

 
  { IDKW_NDN                , _T("НДН")             }, // Нова дата народження

  { IDKW_MN                 , _T("МН")              }, // Місце народження: місто (село, селище) - назва НП
  { IDKW_MND                , _T("МНД")             }, // Місце народження: держава
  { IDKW_NMND               , _T("НМНД")            }, // Нове місце народження: держава
  { IDKW_MNO                , _T("МНО")             }, // Місце народження: область
  { IDKW_NMNO               , _T("НМНО")            }, // Нове місце народження: область
  { IDKW_MNOBL              , _T("МНОБЛ")           }, // Місце народження: область + обл
  { IDKW_NMNOBL             , _T("НМНОБЛ")          }, // Нове місце народження: область + обл
  { IDKW_MNOBL_             , _T("МНОБЛ.")          }, // Місце народження: область + обл.
  { IDKW_NMNOBL_            , _T("НМНОБЛ.")         }, // Нове місце народження: область + обл.
  { IDKW_MNR                , _T("МНР")             }, // Місце народження: Район
  { IDKW_NMNR               , _T("НМНР")            }, // Нове місце народження: Район
  { IDKW_MNRAYON            , _T("МНРАЙОН")         }, // Місце народження: Район + район
  { IDKW_NMNRAYON           , _T("НМНРАЙОН")        }, // Нове місце народження: Район + район
  { IDKW_MNR_N              , _T("МНР-Н")           }, // Місце народження: Район + р-н
  { IDKW_NMNR_N             , _T("НМНР-Н")          }, // Нове місце народження: Район + р-н
  { IDKW_MSS                , _T("МСС")             }, // Місце народження: місто (село, селище) - тип населенного пункту
  { IDKW_NMSS               , _T("НМСС")            }, // Нове місце народження: місто (село, селище) - тип населенного пункту
  { IDKW_MNM                , _T("МНМ")             }, // Місце народження: місто (село, селище) - назва населенного пункту
  { IDKW_NMNM               , _T("НМНМ")            }, // Нове місце народження: місто (село, селище) - назва населенного пункту
  { IDKW_ZA_RAHUNKOM        , _T("ЗА РАХУНКОМ")     }, // Яка за рахунком дитина народилася
  { IDKW_STPRM              , _T("СТПРМ")           }, // Старе прізвище матері


  // O
  { IDKW_OKPO               , _T("ОКПО")            }, // ЄДРПОУ відділу
  { IDKW_ON                 , _T("ОН")              }, // Місце народження: Область
  { IDKW_ONOBL              , _T("ОНОБЛ")           }, // Місце народження: Область + область
  { IDKW_ONOBL_             , _T("ОНОБЛ.")          }, // Місце народження: Область + обл.
  { IDKW_ONOBLAST           , _T("ОНОБЛАСТЬ")       }, // Місце народження: Область + область
  { IDKW_OP                 , _T("ОП")              }, // Місце проживання: Область
  { IDKW_OPOBL              , _T("ОПОБЛ")           }, // Місце проживання: Область + область
  { IDKW_OPOBLAST           , _T("ОПОБЛАСТЬ")       }, // Місце проживання: Область + область
  { IDKW_OPOBL_             , _T("ОПОБЛ.")          }, // Місце проживання: Область + обл.
  { IDKW_OS                 , _T("ОС")              }, // Область смерті
  { IDKW_OSOBL              , _T("ОСОБЛ")           }, // Область смерті: Область + область
  { IDKW_OSOBL_             , _T("ОСОБЛ.")          }, // Область смерті: Область + обл.
  { IDKW_OSOBLAST           , _T("ОСОБЛАСТЬ")       }, // Область смерті: Область + область
  { IDKW_OSZN_RV            , _T("ОСЗН_РВ")         }, // Назва державного органу соцзахисту населення у родовому відмінку

  // P
  { IDKW_PASPORT            , _T("ПАСПОРТ")         }, // Паспортні дані (чоловіка або жінки)
  { IDKW_PASPORT4           , _T("ПАСПОРТЧ")        }, // Паспортні дані чоловіка
  { IDKW_PASPORTZ           , _T("ПАСПОРТЖ")        }, // Паспортні дані жінки
  { IDKW_PASZ               , _T("ПАСЗ")            }, // Паспорт заявника
  { IDKW_PASZ1              , _T("ПАСЗ1")           }, // Паспорт заявника 1
  { IDKW_PASZ2              , _T("ПАСЗ2")           }, // Паспорт заявника 2
  { IDKW_PAZ                , _T("ПАЗ")             }, // Поновлений актовий запис

  { IDKW_PB4                , _T("ПБЧ")             }, // По батькові чоловіка
  { IDKW_PB4OV              , _T("ПБЧОВ")           }, //  По батькові чоловіка в орудному відмінку
  { IDKW_PBB                , _T("ПББ")             }, // По батькові батька
  { IDKW_PBBV               , _T("ПББВ")            }, // По батькові безвісно відсутнього в орудному відмінку
  { IDKW_PBIN               , _T("ПБІН")            }, // По батькові ініциатора в родовому відмінку
  { IDKW_PBINOV             , _T("ПБІНОВ")          }, // По батькові ініциатора в орудному відмінку
  { IDKW_PBKVS              , _T("ПБКВС")           }, // По батькові (кому видано свідоцтво)
  { IDKW_PBM                , _T("ПБМ")             }, // По батькові матері
  { IDKW_PBN                , _T("ПБН")             }, // По батькові новонародженного
  { IDKW_PBP                , _T("ПБП")             }, // По батькові померлого
  { IDKW_PBRV               , _T("ПБРВ")            }, // По батькові у родовому відмінку
  { IDKW_PBZ                , _T("ПБЖ")             }, // По батькові жінки
  { IDKW_PBZOV              , _T("ПБЖОВ")           }, // По батькові жінки в орудному відмінку

  { IDKW_PDT44              , _T("ПДТЧЧ")           }, // першому другому третьому четвертому (чоловік)
  { IDKW_PDT4Z              , _T("ПДТЧЖ")           }, // першому другому третьому четвертому (жінка)

  { IDKW_PERIOD             , _T("ПЕРІОД")          }, // Період

  { IDKW_PIB                , _T("ПІБ")             }, // Прізвище, ім'я, по батькові

  { IDKW_PIB_PO             , _T("ПІБ_ПО")          }, // ПІБ посадової особи
  
  { IDKW_PIBZ               , _T("ПІБЗ")            }, // ПІБ заявника
  { IDKW_PIBZDV             , _T("ПІБЗДВ")          }, // ПІБ заявника у давальному відмінку
  { IDKW_PIDSTAVA           , _T("ПІДСТАВА")        }, // Підстава запису відомостей про батька
  { IDKW_PIDSTAVY           , _T("ПІДСТАВИ")        }, // Підстави (РШ)
  { IDKW_PIB4_RV            , _T("ПІБЧ_РВ")         }, // По батькові чоловіка у родовому відмінку
  { IDKW_PIBB_RV            , _T("ПІББ_РВ")         }, // ПІБ чоловіка у родовому відмінку
  { IDKW_PIBM_RV            , _T("ПІБМ_РВ")         }, // ПІБ матері у родовому відмінку
  { IDKW_PIBN               , _T("ПІБН")            }, // Прізвище, ім'я, по батькові новонародженного
  { IDKW_PIBN_RV            , _T("ПІБН_РВ")         }, // Прізвище, ім'я, по батькові новонародженного у родовому відмінку
  { IDKW_PIBD_RV            , _T("ПІБД_РВ")         }, // Прізвище, ім'я, по батькові новонародженного у родовому відмінку
  { IDKW_PIBP               , _T("ПІБП")            }, // Прізвище, ім'я, по батькові померлого

  { IDKW_PIBRV              , _T("ПІБРВ")           }, // Прізвище, ім'я, по батькові у родовому відмінку
  { IDKW_PIBZ_RV            , _T("ПІБЖ_РВ")         }, // ПІБ жінки у родовому відмінку
  
  { IDKW_PR4OV              , _T("ПРЧОВ")           }, // Прізвище чоловіка в орудному відмінку
  { IDKW_PRB                , _T("ПРБ")             }, // Прізвище батька
  { IDKW_PRIMPB             , _T("ПРІМПБ")          }, // Прізвище, ім'я, по батькові (27)
  { IDKW_PRIMPBRV           , _T("ПРІМПБРВ")        }, // Прізвище, ім'я, по батькові (27) у родовому відмінку
  { IDKW_PRKVS              , _T("ПРКВС")           }, // Прізвище (кому видано свідоцтво) в орудному відмінку
  { IDKW_PRM                , _T("ПРМ")             }, // Прізвище матері
  { IDKW_PRMN               , _T("ПРЧН")            }, // Прізвище чоловіка ПІСЛЯ реєстрації
  { IDKW_PRMNP              , _T("ПРЧНП")           }, // Прізвище чоловіка (нове або прочерк)
  { IDKW_PRMWN              , _T("ПРЧЖН")           }, // Прізвище чоловіка або жінки ПІСЛЯ реєстрації розірвання шлюбу
  { IDKW_PRMS               , _T("ПРЧС")            }, // Прізвище чоловіка ДО реєстрації
  { IDKW_PRN                , _T("ПРН")             }, // Прізвище новонародженого
  { IDKW_PRP                , _T("ПРП")             }, // Прізвище померлого
  { IDKW_PRRV               , _T("ПРРВ")            }, // Прізвище у родовому відмінку
  { IDKW_PRBN               , _T("ПРБВ")            }, // Прізвище безвісно відсутнього
  { IDKW_PRIN               , _T("ПРІН")            }, // Прізвище ініциатора
  { IDKW_PRINOV             , _T("ПРІНОВ")          }, // Прізвище ініциатора в орудному відмінку
  { IDKW_PRWN               , _T("ПРЖН")            }, // Прізвище жінки ПІСЛЯ реєстрації
  { IDKW_PRWS               , _T("ПРЖС")            }, // Прізвище жінки ДО реєстрації
  { IDKW_PRZOV              , _T("ПРЖОВ")           }, // Прізвище жінки в орудному відмінку
  
  { IDKW_PRY4YNAS           , _T("ПРИЧИНАС")        }, // Причина смерті
  { IDKW_POVTORNE           , _T("ПОВТОРНЕ")        }, // Повторне
  { IDKW_POVTORNO           , _T("ПОВТОРНО")        }, // Повторне


  { IDKS_PSH                , _T("ПШ")              }, // Перебував(ла) у шлюбі: чоловік (жінка)
  { IDKS_PSH4               , _T("ПШЧ")             }, // Перебував у шлюбі: чоловік
  { IDKS_PSHZ               , _T("ПШЖ")             }, // Перебувала у шлюбі: жінка

  { IDKW_POMERLA            , _T("ПОМЕР(ЛА)")       }, // Помер(ла)
  { IDKW_POMITKY            , _T("ПОМІТКИ")         }, // Помітки
  { IDKW_POMITKY4           , _T("ПОМІТКИЧ")        }, // Помітки чоловіка
  { IDKW_POMITKYZ           , _T("ПОМІТКИЖ")        }, // Помітки жінки
  { IDKW_POSADA             , _T("ПОСАДА")          }, // Посада спеціаліста
  { IDKW_POSTANOVY          , _T("ПОСТАНОВИ")       }, // 

  // R
  { IDKW_RACSSH_MV          , _T("РАЦСШ_МВ")        }, // РАЦС шлюбу у місцевому відмінку
  { IDKW_RAGSSH_MV          , _T("РАГСШ_МВ")        }, // РАЦС шлюбу у місцевому відмінку
  { IDKW_RACSSH_OV          , _T("РАЦСШ_ОВ")        }, // РАЦС шлюбу в орудному відмінку
  { IDKW_RAGSSH_OV          , _T("РАГСШ_ОВ")        }, // РАЦС шлюбу в орудному відмінку

  { IDKW_RIK                , _T("РІК")             }, // рік
  { IDKW_RISHENNYA          , _T("РІШЕННЯ")         }, // Рішення
  { IDKW_RN                 , _T("РН")              }, // Місце народження: Район
  { IDKW_RN4                , _T("РНЧ")             }, // Дата народження чоловіка: рік  РР (78)
  { IDKW_RN4S               , _T("РНЧС")            }, // Дата народження чоловіка: рік ССРР (1978)
  { IDKW_RNRAYON            , _T("РНРАЙОН")         }, // Місце народження: Район + район
  { IDKW_RNR_N              , _T("РНР-Н")           }, // Місце народження: Район + р-н
  { IDKW_RNZ                , _T("РНЖ")             }, // Дата народження жінки: рік РР (82)
  { IDKW_RNZS               , _T("РНЖС")            }, // Дата народження жінки: рік  ССРР  (1982)
  { IDKW_RP                 , _T("РП")              }, // Місце проживання: Район
  { IDKW_RPRAYON            , _T("РПРАЙОН")         }, // Місце проживання: Район + район
  { IDKW_RPR_N              , _T("РПР-Н")           }, // Місце проживання: Район + р-н
  { IDKW_ROKIV              , _T("РОКІВ")           }, // років
  { IDKW_RPROPYSOM          , _T("РПРОПИСОМ")       }, // Дата народження: рік прописом
  { IDKW_RR                 , _T("РР")              }, // Дата реєстрації, рік: рр
  { IDKW_RRN                , _T("РРН")             }, // Дата народження, рік: рр
  { IDKW_RRRR               , _T("РРРР")            }, // Дата реєстрації, рік: рррр
  { IDKW_RRRRN              , _T("РРРРН")           }, // Дата народження, рік: рррр
  { IDKW_RS                 , _T("РС")              }, // Місце смерті: Район
  { IDKW_RSM                , _T("РСМ")             }, // Дата смерті: рррр - рік
  { IDKW_RSR_N              , _T("РСР-Н")           }, // Місце смерті: Район + р-н
  { IDKW_RSRAYON            , _T("РСРАЙОН")         }, // Місце смерті: Район + район
  { IDKW_RSUDU              , _T("РСУДУ")           }, //
  { IDKW_RV4                , _T("РВЧ")             }, // Сімейний стан чоловіка, детально: розлучений/вдівець
  { IDKW_RVZ                , _T("РВЖ")             }, // Сімейний стан жінки, детально: розлучена/вдова

  // Y
  { IDKW_YAKY               , _T("ЯКИЙ")            }, // "який" або "яка" (залижить від статі)

  // V
  { IDKW_VIK                , _T("ВІК")             }, // Вік
  { IDKW_VRACSSH_MV         , _T("ВРАЦСШ_МВ")       },
  { IDKW_VRACSRSH_MV        , _T("ВРАЦСРШ_МВ")      },
  { IDKW_VUL                , _T("ВУЛ")             }, // Місце проживання: вулиця
  { IDKW_VUL4               , _T("ВУЛЧ")            }, // Місце проживання чоловіка: вулиця
  { IDKW_VULB               , _T("ВУЛБ")            }, // Місце проживання батька: вулиця
  { IDKW_VULM               , _T("ВУЛМ")            }, // Місце проживання матері: вулиця
  { IDKW_VULZ               , _T("ВУЛЖ")            }, // Місце проживання жінки: вулиця
  { IDKW_VYD                , _T("ВИД")             }, // Вид актового запису
  { IDKW_VYROK              , _T("ВИРОК")           }, // Вирок

  { IDKW_U_VIDDILI          , _T("У ВІДДІЛІ")       }, // Назва відділу РАГС в орудному відмінку

  // Z
  { IDKW_Z                  , _T("З")               }, // Період (з) ДД МММ РРРР р.
  { IDKW_Z44                , _T("ЗЧЧ")             }, // Період (з) ЧЧ (ДД)
  { IDKW_ZAYAVNYK           , _T("ЗАЯВНИК")         }, // ПІБ заявника
  { IDKW_ZMINY              , _T("ЗМІНИ")           }, // Які зміни належить внести до АЗ (повідомлення про внесення змін)
  { IDKW_ZMMM               , _T("ЗМММ")            }, // Період (з) МММ
  { IDKW_ZPS                , _T("ЗПС")             }, // Реєстрація з пропуском строку
  { IDKW_ZVILNENA           , _T("ЗВІЛЬНЕНА")       }, // Від сплати держмита звільнена
  { IDKW_ZVILNENY           , _T("ЗВІЛЬНЕНИЙ")      }, // Від сплати держмита звільнений

  { 0, NULL},
};


////////////////////////////////////////////////
// CKeywords
//
CKeywords::CKeywords() {
  for( int i(0); Keywords[i].szKeyword; i++ ) {
    m_map.SetAt(Keywords[i].szKeyword, &Keywords[i]);
  }
}
CKeywords::~CKeywords() {
  m_map.RemoveAll();
}
const Keyword* CKeywords::Lookup(LPCTSTR szKey) {
  const Keyword* pKeyword = NULL;
  if ( m_map.Lookup(szKey, (void*&)pKeyword) ) {
    return pKeyword;
  }
  return NULL;
}